notes/resources/websockets/websockets.org
#+TITLE: WebSockets
#+DATE: [2019-05-29 Wed 14:20]
#+AUTHOR: Damian Chrzanowski
#+EMAIL: pjdamian.chrzanowski@gmail.com
#+OPTIONS: H:2 toc:2
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
#+HTML_HEAD: <link rel="icon" href="../../assets/favicon.ico">

[[file:../../index.org][Home Page]]

* [[https://socket.io/][Official Docs]]

* Installation
  - Server
  #+begin_src shell
  npm i socket.io
  #+end_src
  - Client (server side)
  #+begin_src shell
  npm i socket.io-client
  #+end_src

* JS

** Sample server script
   #+begin_src js
     var app = require('express')();
     var server = require('http').Server(app);
     var io = require('socket.io')(server);

     server.listen(8000);
     console.log('-- Server Listening on http://localhost:8000 --');

     // broadcast a message to all connected
     // e.g. http://localhost:8000/broadcast?msg=HelloWorld
     app.get('/broadcast', (req, res) => {
         var msg = req.query.msg;
         io.emit('msg', { msg: 'msg'});
         res.end();
     });

     // send a message to a particular client
     // e.g. http://localhost:8000/msg?id=SOCKET.ID&msg=HelloWorld
     app.get('/msg', (req, res) => {
         var socketId = req.query.id;
         var msg = req.query.msg;

         io.to(socketId).emit('msg', { msg: msg });
         res.end();
     });

     // listen for incoming connections
     io.on('connection', (socket) => {
         // print out auth details sent from the client
         console.log("Client Auth: pass=" + socket.handshake.query.pass + ", user=" + socket.handshake.query.user);
         // print out the Socket ID that is assigned automatically upon a new connection
         console.log('Client ID: ' + socket.id + ' connected');

         // Print out a message sent from a client
         socket.on('msg', (data) => {
             console.log('Client ID: ' + socket.id + ' , says: ' + JSON.stringify(data, null, 2));
         });

         // Notify of client disconnecting
         socket.on('disconnect', () => {
             console.log('Client ID: ' + socket.id + ' disconnected');
         });

         // Send a message to the client. In this case let the client know its id
         socket.emit('msg', { id: socket.id});
     });
   #+end_src

