notes/resources/websockets/websockets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-29 Wed 14:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>WebSockets</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Chrzanowski" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
<link rel="icon" href="../../assets/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">WebSockets</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6d5f8fc">1. Official Docs</a></li>
<li><a href="#org4728eff">2. Installation</a></li>
<li><a href="#org6387808">3. JS</a>
<ul>
<li><a href="#org68c67cc">3.1. Sample server script</a></li>
<li><a href="#orgc8ad366">3.2. Sample server-side client script</a></li>
<li><a href="#orgbce3dd2">3.3. Emitter cheatsheet</a></li>
</ul>
</li>
<li><a href="#org4ee4112">4. NestJS</a>
<ul>
<li><a href="#org382bd2b">4.1. Server</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="../../index.html">Home Page</a>
</p>

<div id="outline-container-org6d5f8fc" class="outline-2">
<h2 id="org6d5f8fc"><span class="section-number-2">1</span> <a href="https://socket.io/">Official Docs</a></h2>
</div>

<div id="outline-container-org4728eff" class="outline-2">
<h2 id="org4728eff"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Server</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">npm i socket.io
</pre>
</div>
<ul class="org-ul">
<li>Client (server side)</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">npm i socket.io-client
</pre>
</div>
</div>
</div>

<div id="outline-container-org6387808" class="outline-2">
<h2 id="org6387808"><span class="section-number-2">3</span> JS</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org68c67cc" class="outline-3">
<h3 id="org68c67cc"><span class="section-number-3">3.1</span> Sample server script</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">app</span> = require<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'express'</span><span style="color: #fff0f5;">)()</span>;
<span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">server</span> = require<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'http'</span><span style="color: #fff0f5;">)</span>.Server<span style="color: #fff0f5;">(</span>app<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">io</span> = require<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'socket.io'</span><span style="color: #fff0f5;">)(</span>server<span style="color: #fff0f5;">)</span>;

server.listen<span style="color: #fff0f5;">(</span>8000<span style="color: #fff0f5;">)</span>;
console.log<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'-- Server Listening on http://localhost:8000 --'</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">broadcast a message to all connected</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">e.g. http://localhost:8000/broadcast?msg=HelloWorld</span>
app.get<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'/broadcast'</span>, <span style="color: #c678dd;">(</span>req, res<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    <span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">msg</span> = req.query.msg;
    io.emit<span style="color: #98be65;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #00bfff;">{</span> msg: <span style="color: #98be65;">'msg'</span><span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;
    res.end<span style="color: #98be65;">()</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">send a message to a particular client</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">e.g. http://localhost:8000/msg?id=SOCKET.ID&amp;msg=HelloWorld</span>
app.get<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'/msg'</span>, <span style="color: #c678dd;">(</span>req, res<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    <span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">socketId</span> = req.query.id;
    <span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">msg</span> = req.query.msg;

    io.to<span style="color: #98be65;">(</span>socketId<span style="color: #98be65;">)</span>.emit<span style="color: #98be65;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #00bfff;">{</span> msg: msg <span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;
    res.end<span style="color: #98be65;">()</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">listen for incoming connections</span>
io.on<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'connection'</span>, <span style="color: #c678dd;">(</span>socket<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">print out auth details sent from the client</span>
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"Client Auth: pass="</span> + socket.handshake.query.pass + <span style="color: #98be65;">", user="</span> + socket.handshake.query.user<span style="color: #98be65;">)</span>;
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">print out the Socket ID that is assigned automatically upon a new connection</span>
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">'Client ID: '</span> + socket.id + <span style="color: #98be65;">' connected'</span><span style="color: #98be65;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Print out a message sent from a client</span>
    socket.on<span style="color: #98be65;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #00bfff;">(</span>data<span style="color: #00bfff;">)</span> =&gt; <span style="color: #00bfff;">{</span>
        console.log<span style="color: #a9a1e1;">(</span><span style="color: #98be65;">'Client ID: '</span> + socket.id + <span style="color: #98be65;">' , says: '</span> + JSON.stringify<span style="color: #32cd32;">(</span>data, <span style="color: #a9a1e1;">null</span>, 2<span style="color: #32cd32;">)</span><span style="color: #a9a1e1;">)</span>;
    <span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Notify of client disconnecting</span>
    socket.on<span style="color: #98be65;">(</span><span style="color: #98be65;">'disconnect'</span>, <span style="color: #00bfff;">()</span> =&gt; <span style="color: #00bfff;">{</span>
        console.log<span style="color: #a9a1e1;">(</span><span style="color: #98be65;">'Client ID: '</span> + socket.id + <span style="color: #98be65;">' disconnected'</span><span style="color: #a9a1e1;">)</span>;
    <span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Send a message to the client. In this case let the client know its id</span>
    socket.emit<span style="color: #98be65;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #00bfff;">{</span> id: socket.id<span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
