notes/resources/websockets/websockets.org
** Sample server-side client script
   #+begin_src js
     var clientNum = 1;
     var port = 8000 + clientNum;
     var app = require('express')();
     var server = require('http').Server(app);
     var socket = require('socket.io-client')('http://localhost:8000', { query: 'pass=FooBaz' + clientNum + '&user=FooBar' + clientNum});

     server.listen(port);
     console.log('-- Server Listening on http://localhost:' + port + ' --');

     // send a message to the server
     // e.g. http://localhost:8001/msg?msg=HelloWorld
     app.get('/msg', (req, res) => {
         var msg = req.query.msg;
         socket.emit('msg', { msg: msg});
         res.end();
     });

     // disconnect from the server
     app.get('/exit', (req, res) => {
         socket.disconnect();
         res.end();
     });

     // on connect
     socket.on('connect', () => {
         console.log('client ' + clientNum + ' connected');
     });

     // on message received
     socket.on('msg', (data) => {
         console.log('client ' + clientNum + ' msg: ', data);
     });

     // on disconnect
     socket.on('disconnect', () => {
         console.log('client ' + clientNum + ' disconnected');
     });

     console.log('-- Client ' + clientNum + ' Started --');
   #+end_src

