notes/resources/websockets/websockets.html

<div id="outline-container-orgc8ad366" class="outline-3">
<h3 id="orgc8ad366"><span class="section-number-3">3.2</span> Sample server-side client script</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">clientNum</span> = 1;
<span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">port</span> = 8000 + clientNum;
<span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">app</span> = require<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'express'</span><span style="color: #fff0f5;">)()</span>;
<span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">server</span> = require<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'http'</span><span style="color: #fff0f5;">)</span>.Server<span style="color: #fff0f5;">(</span>app<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">socket</span> = require<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'socket.io-client'</span><span style="color: #fff0f5;">)(</span><span style="color: #98be65;">'http://localhost:8000'</span>, <span style="color: #c678dd;">{</span> query: <span style="color: #98be65;">'pass=FooBaz'</span> + clientNum + <span style="color: #98be65;">'&amp;user=FooBar'</span> + clientNum<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

server.listen<span style="color: #fff0f5;">(</span>port<span style="color: #fff0f5;">)</span>;
console.log<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'-- Server Listening on http://localhost:'</span> + port + <span style="color: #98be65;">' --'</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">send a message to the server</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">e.g. http://localhost:8001/msg?msg=HelloWorld</span>
app.get<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'/msg'</span>, <span style="color: #c678dd;">(</span>req, res<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    <span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">msg</span> = req.query.msg;
    socket.emit<span style="color: #98be65;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #00bfff;">{</span> msg: msg<span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;
    res.end<span style="color: #98be65;">()</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">disconnect from the server</span>
app.get<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'/exit'</span>, <span style="color: #c678dd;">(</span>req, res<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    socket.disconnect<span style="color: #98be65;">()</span>;
    res.end<span style="color: #98be65;">()</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">on connect</span>
socket.on<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'connect'</span>, <span style="color: #c678dd;">()</span> =&gt; <span style="color: #c678dd;">{</span>
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">'client '</span> + clientNum + <span style="color: #98be65;">' connected'</span><span style="color: #98be65;">)</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">on message received</span>
socket.on<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #c678dd;">(</span>data<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">'client '</span> + clientNum + <span style="color: #98be65;">' msg: '</span>, data<span style="color: #98be65;">)</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">on disconnect</span>
socket.on<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'disconnect'</span>, <span style="color: #c678dd;">()</span> =&gt; <span style="color: #c678dd;">{</span>
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">'client '</span> + clientNum + <span style="color: #98be65;">' disconnected'</span><span style="color: #98be65;">)</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

console.log<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'-- Client '</span> + clientNum + <span style="color: #98be65;">' Started --'</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
