notes/resources/websockets/websockets.html

<div id="outline-container-orgbce3dd2" class="outline-3">
<h3 id="orgbce3dd2"><span class="section-number-3">3.3</span> Emitter cheatsheet</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-js">io.on<span style="color: #fff0f5;">(</span><span style="color: #98be65;">'connect'</span>, onConnect<span style="color: #fff0f5;">)</span>;

<span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onConnect</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">socket</span><span style="color: #fff0f5;">){</span>

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to the client</span>
    socket.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'hello'</span>, <span style="color: #98be65;">'can you hear me?'</span>, 1, 2, <span style="color: #98be65;">'abc'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to all clients except sender</span>
    socket.broadcast.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'broadcast'</span>, <span style="color: #98be65;">'hello friends!'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to all clients in 'game' room except sender</span>
    socket.to<span style="color: #c678dd;">(</span><span style="color: #98be65;">'game'</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'nice game'</span>, <span style="color: #98be65;">"let's play a game"</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to all clients in 'game1' and/or in 'game2' room, except sender</span>
    socket.to<span style="color: #c678dd;">(</span><span style="color: #98be65;">'game1'</span><span style="color: #c678dd;">)</span>.to<span style="color: #c678dd;">(</span><span style="color: #98be65;">'game2'</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'nice game'</span>, <span style="color: #98be65;">"let's play a game (too)"</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to all clients in 'game' room, including sender</span>
    io.<span style="color: #51afef; font-style: italic;">in</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">'game'</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'big-announcement'</span>, <span style="color: #98be65;">'the game will start soon'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to all clients in namespace 'myNamespace', including sender</span>
    io.of<span style="color: #c678dd;">(</span><span style="color: #98be65;">'myNamespace'</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'bigger-announcement'</span>, <span style="color: #98be65;">'the tournament will start soon'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to a specific room in a specific namespace, including sender</span>
    io.of<span style="color: #c678dd;">(</span><span style="color: #98be65;">'myNamespace'</span><span style="color: #c678dd;">)</span>.to<span style="color: #c678dd;">(</span><span style="color: #98be65;">'room'</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'event'</span>, <span style="color: #98be65;">'message'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to individual socketid (private message)</span>
    io.to<span style="color: #c678dd;">(</span><span style="color: #98be65;">`${socketId}`</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'hey'</span>, <span style="color: #98be65;">'I just met you'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">WARNING: `socket.to(socket.id).emit()` will NOT work, as it will send to everyone in the room</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">named `socket.id` but the sender. Please use the classic `socket.emit()` instead.</span>

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending with acknowledgement</span>
    socket.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'question'</span>, <span style="color: #98be65;">'do you think so?'</span>, <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #98be65;">(</span><span style="color: #db5762;">answer</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{}</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending without compression</span>
    socket.compress<span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">false</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'uncompressed'</span>, <span style="color: #98be65;">"that's rough"</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending a message that might be dropped if the client is not ready to receive messages</span>
    socket.<span style="color: #51afef; font-style: italic;">volatile</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'maybe'</span>, <span style="color: #98be65;">'do you really need it?'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">specifying whether the data to send has binary data</span>
    socket.binary<span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">false</span><span style="color: #c678dd;">)</span>.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'what'</span>, <span style="color: #98be65;">'I have no binaries!'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to all clients on this node (when using multiple nodes)</span>
    io.local.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'hi'</span>, <span style="color: #98be65;">'my lovely babies'</span><span style="color: #c678dd;">)</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">sending to all connected clients</span>
    io.emit<span style="color: #c678dd;">(</span><span style="color: #98be65;">'an event sent to all connected clients'</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>;
</pre>
</div>
</div>
</div>
</div>
