notes/resources/websockets/websockets.org
** Server
   - In NestJS we simply create the whole code as a ~provider~ which reacts to events on its own, but can also be injected as a service to access any socket.io server methods
   #+begin_src typescript
     import {
         SubscribeMessage,
         WebSocketGateway,
         WebSocketServer,
         OnGatewayConnection,
         OnGatewayDisconnect,
     } from '@nestjs/websockets';
     import { Client, Server } from 'socket.io';

     @WebSocketGateway(8000)
     export class EventsGateway implements OnGatewayConnection, OnGatewayDisconnect {
         @WebSocketServer()
         server: Server;

         // listen for 'msg' events
         @SubscribeMessage('msg')
         async msg(client: Client, data: string) {
             console.log("Client ID: " + client.id + ", says:" + JSON.stringify(data));
             return;
         }

         // Required by OnGatewayConnection interface to listen to new connections
         handleConnection(client: any, ...args: any[]) {
             console.log("Client ID: " + client.id + " connected");
             console.log("Client Auth: pass=" + client.handshake.query.pass + ", user=" + client.handshake.query.user);
             this.server.emit('msg', { id: client.id });
             return;
         }

         // Required by OnGatewayDisconnect interface to listen for disconnections
         handleDisconnect(client: any) {
             console.log("Client ID: " + client.id + " disconnected");
             return;
         }

         // send a message to a specific socket id
         sendMsg(id: string, msg: string) {
             this.server.to(id).emit('msg', { msg: msg });
         }
     }
   #+end_src

   #+BEGIN_EXPORT html
   <script src="../../assets/jquery-3.3.1.min.js"></script>
   <script src="../../assets/notes.js"></script>
   #+END_EXPORT
