notes/resources/websockets/websockets.html

<div id="outline-container-org4ee4112" class="outline-2">
<h2 id="org4ee4112"><span class="section-number-2">4</span> NestJS</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org382bd2b" class="outline-3">
<h3 id="org382bd2b"><span class="section-number-3">4.1</span> Server</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>In NestJS we simply create the whole code as a <code>provider</code> which reacts to events on its own, but can also be injected as a service to access any socket.io server methods</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span>
    SubscribeMessage,
    WebSocketGateway,
    WebSocketServer,
    OnGatewayConnection,
    OnGatewayDisconnect,
<span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">'@nestjs/websockets'</span>;
<span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> Client, Server <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">'socket.io'</span>;

@WebSocketGateway<span style="color: #fff0f5;">(</span>8000<span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">class</span> <span style="color: #ECBE7B;">EventsGateway</span> <span style="color: #51afef; font-style: italic;">implements</span> <span style="color: #ECBE7B;">OnGatewayConnection</span>, <span style="color: #ECBE7B;">OnGatewayDisconnect</span> <span style="color: #fff0f5;">{</span>
    @WebSocketServer<span style="color: #c678dd;">()</span>
    server: Server;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">listen for 'msg' events</span>
    @SubscribeMessage<span style="color: #c678dd;">(</span><span style="color: #98be65;">'msg'</span><span style="color: #c678dd;">)</span>
    <span style="color: #51afef; font-style: italic;">async</span> msg<span style="color: #c678dd;">(</span>client: Client, data: <span style="color: #51afef; font-style: italic;">string</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"Client ID: "</span> + client.id + <span style="color: #98be65;">", says:"</span> + JSON.stringify<span style="color: #00bfff;">(</span>data<span style="color: #00bfff;">)</span><span style="color: #98be65;">)</span>;
        <span style="color: #51afef; font-style: italic;">return</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Required by OnGatewayConnection interface to listen to new connections</span>
    handleConnection<span style="color: #c678dd;">(</span>client: <span style="color: #51afef; font-style: italic;">any</span>, ...args: <span style="color: #51afef; font-style: italic;">any</span><span style="color: #98be65;">[]</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"Client ID: "</span> + client.id + <span style="color: #98be65;">" connected"</span><span style="color: #98be65;">)</span>;
        console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"Client Auth: pass="</span> + client.handshake.query.pass + <span style="color: #98be65;">", user="</span> + client.handshake.query.user<span style="color: #98be65;">)</span>;
        <span style="color: #51afef; font-style: italic;">this</span>.server.emit<span style="color: #98be65;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #00bfff;">{</span> id: client.id <span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;
        <span style="color: #51afef; font-style: italic;">return</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Required by OnGatewayDisconnect interface to listen for disconnections</span>
    handleDisconnect<span style="color: #c678dd;">(</span>client: <span style="color: #51afef; font-style: italic;">any</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"Client ID: "</span> + client.id + <span style="color: #98be65;">" disconnected"</span><span style="color: #98be65;">)</span>;
        <span style="color: #51afef; font-style: italic;">return</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">send a message to a specific socket id</span>
    sendMsg<span style="color: #c678dd;">(</span>id: <span style="color: #51afef; font-style: italic;">string</span>, msg: <span style="color: #51afef; font-style: italic;">string</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef; font-style: italic;">this</span>.server.to<span style="color: #98be65;">(</span>id<span style="color: #98be65;">)</span>.emit<span style="color: #98be65;">(</span><span style="color: #98be65;">'msg'</span>, <span style="color: #00bfff;">{</span> msg: msg <span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>

<script src="../../assets/jquery-3.3.1.min.js"></script>
<script src="../../assets/notes.js"></script>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-05-29 Wed 14:20</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2019-05-29 Wed 14:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
